---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.FabricSheetLayoutPattern.NumberWithSpacing
enum: Autodesk.Revit.DB.Structure.FabricSheetLayoutPattern
source: html/a13c4016-99f3-fc97-51ef-0ec2d534295a.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetLayoutPattern.NumberWithSpacing

Both the spacing between the rebars and the number of rebars are constant based on input.